src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СотрудникиСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтактыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтактыМессенджеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПоследнегоДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерМессенджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчаствоватьВРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Мессенджеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Мессенджеры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>facebook</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>instagram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ok</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>vk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>whatsapp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

//  Имя событие для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Внешняя система'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Процедура, обработчик события "ОбработкаПолученияФормы".
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			ТипВнешнейСистемы = Параметры.Ключ.ТипВнешнейСистемы;
		ИначеЕсли Параметры.Свойство("ТипВнешнейСистемы") Тогда
			ТипВнешнейСистемы = Параметры.ТипВнешнейСистемы;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда
		
		Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаНастройкиЭлектронныхКартWallet"; 
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Calltouch Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаCalltouch";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Roistat Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаRoistat";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ЯндексМетрика Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаЯндексМетрика";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ПроДокторов Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаПроДокторов";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Webhook Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаWebhook";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаВиджетОнлайнЗаписи";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ИЭМК Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаИЭМК";

		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.IPТелефония Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаIPТелефония";

		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ЯндексКарты Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаЯндексКарты";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.CoMagic Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаCoMagic";	
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.JivoSite Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма		 = "ФормаЭлементаJivoSite";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Marquiz Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЭлементаMarquiz";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Tilda Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЭлементаTilda";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.TapLink Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЭлементаTapLink";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.КонтурСтрахование Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЭлементаКонтурСтрахование";
			
		ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЭлементаСистемаБыстрыхПлатежей";
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

// Функция - Получить внешнюю систему
//
// Параметры:
//  КлючПриложения		 - 	 - 
//  ТипыСистем			 - 	 - 
//  ТолькоИспользуемое	 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ВозвращатьВсе		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВнешнююСистему(
	КлючПриложения		 = Неопределено,
	Знач ТипыСистем		 = Неопределено,
	ТолькоИспользуемое	 = Истина,
	СтруктурнаяЕдиница	 = Неопределено,
	ВозвращатьВсе		 = Ложь) Экспорт
	
	Если ТипЗнч(ТипыСистем) <> Тип("Массив") Тогда
		
		ТипыСистем = Новый_Массив(ТипыСистем);
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоИспользуемое = ИСТИНА
	|				ТОГДА ВнешниеСистемы.Используется = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Ключ <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.КлючПриложения = &Ключ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ НЕОПРЕДЕЛЕНО В (&ТипыСистем)
	|				ТОГДА ВнешниеСистемы.ТипВнешнейСистемы В (&ТипыСистем)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ ВнешниеСистемы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Ключ"              , ?(ЗначениеЗаполнено(КлючПриложения)    , КлючПриложения    , Неопределено));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Неопределено));
	Запрос.УстановитьПараметр("ТолькоИспользуемое", ТолькоИспользуемое);
    Запрос.УстановитьПараметр("ТипыСистем"        , ТипыСистем);
	
	Если ВозвращатьВсе = Ложь Тогда
		Результат = Запрос.Выполнить().Выбрать();
		Возврат ?(Результат.Следующий(), Результат.Ссылка, Справочники.ВнешниеСистемы.ПустаяСсылка());
	Иначе
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецФункции

// Функция, возвращает флаг использования мессенджера.
//
Функция МессенджерИспользуется(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ТипыВнешнихСистем = ПолучитьМассивТиповВнешнихСистемМессенджера();
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИЛИ ВнешниеСистемы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("ТипыВнешнихСистем", ТипыВнешнихСистем);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

// Функция, возвращает типы внешних систем мессенджера.
//
Функция ПолучитьМассивТиповВнешнихСистемМессенджера() Экспорт
	
	ТипыВнешнихСистем = Новый Массив;
	// ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.Chat2Desk);
	ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.VkontakteApi);
	// ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.Instagram);
	ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.GreenApi);
	ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.Telegram);
	ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.Viber);
	
	Возврат ТипыВнешнихСистем;
	
КонецФункции

// Функция, возвращает типы внешних систем мессенджера, в которых можно начинать диалог первым.
//
Функция ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым() Экспорт
	
	ТипыВнешнихСистем = Новый Массив;
	ТипыВнешнихСистем.Добавить(Перечисления.ТипыВнешнихСистем.GreenApi);
	
	Возврат ТипыВнешнихСистем;
	
КонецФункции

// Функция - Получить внешние системы
//
// Параметры:
//  ТипСистемы			 - 	 - 
//  ТолькоИспользуемое	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВнешниеСистемы(ТипСистемы = Неопределено, ТолькоИспользуемое = Истина, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Код КАК Код,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоИспользуемое = ИСТИНА
	|				ТОГДА ВнешниеСистемы.Используется = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ТипСистемы <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.ТипВнешнейСистемы = &ТипСистемы
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");	
	
    Запрос.УстановитьПараметр("ТипСистемы"        , ?(ЗначениеЗаполнено(ТипСистемы), ТипСистемы, Неопределено));
	Запрос.УстановитьПараметр("ТолькоИспользуемое", ТолькоИспользуемое);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает внешние системы мессенджера.
//
Функция ПолучитьВнешниеСистемыМессенджераChatApi(СтруктурнаяЕдиница = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.ВерсияДанных КАК ВерсияДанных,
	|	ВнешниеСистемы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВнешниеСистемы.Код КАК Код,
	|	ВнешниеСистемы.Наименование КАК Наименование,
	|	ВнешниеСистемы.Используется КАК Используется,
	|	ВнешниеСистемы.КлючПриложения КАК КлючПриложения,
	|	ВнешниеСистемы.Параметры КАК Параметры,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.ТокенДоступа КАК ТокенДоступа,
	|	ВнешниеСистемы.Предопределенный КАК Предопределенный,
	|	ВнешниеСистемы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ВнешниеСистемы.Представление КАК Представление,
	|	0 КАК Порядок
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|	И ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка,
	|	ВнешниеСистемы.ВерсияДанных,
	|	ВнешниеСистемы.ПометкаУдаления,
	|	ВнешниеСистемы.Код,
	|	ВнешниеСистемы.Наименование,
	|	ВнешниеСистемы.Используется,
	|	ВнешниеСистемы.КлючПриложения,
	|	ВнешниеСистемы.Параметры,
	|	ВнешниеСистемы.ТипВнешнейСистемы,
	|	ВнешниеСистемы.ТокенДоступа,
	|	ВнешниеСистемы.Предопределенный,
	|	ВнешниеСистемы.ИмяПредопределенныхДанных,
	|	ВнешниеСистемы.Представление,
	|	1
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|	И ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Неопределено));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

// Процедура - Установить состояние внешней системе
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Используется	 - 	 - 
//
Процедура УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Синхронизирована = Истина, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если (ЗначениеЗаполнено(СтруктурнаяЕдиница) И СтруктурнаяЕдиница <> ВнешняяСистема.СтруктурнаяЕдиница)
		Или ВнешняяСистема.Используется <> Используется Тогда
		
		ВнешняяСистемаОбъект = ВнешняяСистема.ПолучитьОбъект(); 
		ВнешняяСистемаОбъект.Используется     = Используется;
		ВнешняяСистемаОбъект.Синхронизирована = Синхронизирована;
		ВнешняяСистемаОбъект.Записать();
		
	КонецЕсли;

КонецПроцедуры

// Функция - Создать внешнюю систему
//
// Параметры:
//  ТипВнешнейСистемы	 - 	 - 
//  Наименование		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, Наименование = Неопределено, Используется = Неопределено, КлючПриложения = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ВнешняяСистемаОбъект = Справочники.ВнешниеСистемы.СоздатьЭлемент();
	ВнешняяСистемаОбъект.ТипВнешнейСистемы = ТипВнешнейСистемы;
	ВнешняяСистемаОбъект.КлючПриложения    = ?(ЗначениеЗаполнено(КлючПриложения), Строка(КлючПриложения), Строка(Новый УникальныйИдентификатор()));
	
	Если Используется <> Неопределено Тогда 
		ВнешняяСистемаОбъект.Используется = Используется;
	КонецЕсли;
	
	ТипыУпрМзКабинета = ТипыВнешнихСистемУправляемыхизЛичногоКабинета();
	
	Если ТипыУпрМзКабинета.Найти(ТипВнешнейСистемы) <> Неопределено Тогда		
		ВнешняяСистемаОбъект.УправлениеВЛичномКабинете = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ВнешняяСистемаОбъект.Наименование = Наименование;
	Иначе
		ВнешняяСистемаОбъект.Наименование = Строка(ТипВнешнейСистемы);
	КонецЕсли;
		
	ВнешняяСистемаОбъект.Записать();

	Возврат ВнешняяСистемаОбъект.Ссылка;
	
КонецФункции

// Функция - Типы внешних систем управляемыхиз личного кабинета
// 
// Возвращаемое значение:
//   - 
//
Функция ТипыВнешнихСистемУправляемыхизЛичногоКабинета() Экспорт
	
	ВрМассив = Новый Массив;
    ВрМассив.Добавить(Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи);

	Возврат ВрМассив;
	
КонецФункции

// Процедура, создает внешнюю систему в CRM и ретрансляторе.
//
Процедура ПодключитьВнешнююСистему(ВнешняяСистема, Отказ, УИДСессии = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Если ПараметрыСеанса.ОбластьДанныхИспользование И Не ЗначениеЗаполнено(Константы.ВнешняяПубликацияАдрес.Получить()) Тогда  // адрес внешней публикации нужен для ретранслятора вне зависимости облако это или нет
	//	
	//	АдресПубликации = "https://cloud.stoma1c.ru/" + ПолучитьИмяПубликацииИнформационнойБазы() + "/" + Формат(ПараметрыСеанса.ОбластьДанныхЗначение, "ЧГ=");
	//	Константы.ВнешняяПубликацияАдрес.Установить(АдресПубликации);
	//	
	// КонецЕсли;
	
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	Если ЭтоОблако 
		И Не ЗначениеЗаполнено(Константы.ВнешняяПубликацияАдрес.Получить()) Тогда
		
		АдресПубликации = "https://cloud.stoma1c.ru/app/" + Формат(ПараметрыСеанса.ОбластьДанныхЗначение, "ЧГ=");
		Константы.ВнешняяПубликацияАдрес.Установить(АдресПубликации);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОписаниеОшибки = ""; 
	// создать (обновить) внешнюю систему в crm и ретрансляторе
	УидСессии        = ?(УИДСессии = Неопределено, ЛичныйКабинет.УидТекущейСессии(), УИДСессии);
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;    
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,, Отказ);  
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Проверить существование внешней системы
// 
// Возвращаемое значение:
//   - 
//
Функция СуществуетВнешняяСистемаПоТипу(
	ТипСистемы = Неопределено, 
	ТолькоИспользуемое = Истина, 
	СтруктурнаяЕдиница = Неопределено, 
	ТекущаяВнешняяСистема = Неопределено) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Код КАК Код,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоИспользуемое = ИСТИНА
	|				ТОГДА ВнешниеСистемы.Используется = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ТипСистемы <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.ТипВнешнейСистемы = &ТипСистемы
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВнешниеСистемы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВнешниеСистемы.Ссылка <> &ТекущаяВнешняяСистема");	
	
    Запрос.УстановитьПараметр("ТипСистемы"           , ?(ЗначениеЗаполнено(ТипСистемы), ТипСистемы, Неопределено));
	Запрос.УстановитьПараметр("ТолькоИспользуемое"   , ТолькоИспользуемое);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"   , СтруктурнаяЕдиница); 
	Запрос.УстановитьПараметр("ТекущаяВнешняяСистема", ТекущаяВнешняяСистема);

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, возвращает массив, содержащий данные внешних систем мессенджера.
//
Функция ПолучитьДанныеВнешнихСистемМессенджера(СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ТекущаяСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Параметры КАК Параметры,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.КлючПриложения КАК КлючПриложения
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В(&СтруктурныеЕдиницы)");
	
	Запрос.УстановитьПараметр("ТипыВнешнихСистем"	, ПолучитьМассивТиповВнешнихСистемМессенджера());
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы"	, Новый_Массив(ТекущаяСтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВнешнихСистем = Новый Массив;
	
	СегментыСотрудника = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыВС = Выборка.Параметры.Получить();
		
		Если Не ЗначениеЗаполнено(ПараметрыВС) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыВС.Свойство("СегментСотрудников") И ЗначениеЗаполнено(ПараметрыВС.СегментСотрудников) Тогда
			
			Если СегментыСотрудника = Неопределено Тогда
				СегментыСотрудника = РегистрыСведений.СотрудникиСегмента.ПолучитьСегментыСотрудника(ПараметрыСеанса.ТекущийПользователь.Сотрудник);
			КонецЕсли;
			
			Если СегментыСотрудника.Найти(ПараметрыВС.СегментСотрудников) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеВнешнихСистем.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
		
	КонецЦикла;

	Возврат ДанныеВнешнихСистем;
	
КонецФункции

// Функция, возвращает картинку типа внешней системы.
//
Функция КартинкаТипаВнешнейСистемы(ТипВнешнейСистемы) Экспорт
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		Картинка = БиблиотекаКартинок.Whatsapp16;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		Картинка = БиблиотекаКартинок.Telegram16;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		Картинка = БиблиотекаКартинок.Vk16;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		Картинка = БиблиотекаКартинок.Viber16;
	Иначе
		Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

// Функция, возвращает картинку внешней системы.
//
Функция ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы) Экспорт
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Calltouch Тогда
		Возврат БиблиотекаКартинок.CalltouchBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда
		Возврат БиблиотекаКартинок.ЛоготипChat2Desk;                                 
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		Возврат БиблиотекаКартинок.WhatsappBigIcon;                                 
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.CoMagic Тогда
		Возврат БиблиотекаКартинок.CoMagicBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.IPТелефония Тогда
		Возврат БиблиотекаКартинок.ЛоготипТелефония;                                 
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.JivoSite Тогда
		Возврат БиблиотекаКартинок.JivoSite_большая;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Marquiz Тогда
		Возврат БиблиотекаКартинок.MarquizBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Roistat Тогда
		Возврат БиблиотекаКартинок.ЛоготипRoistat;                                   
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.TapLink Тогда
		Возврат БиблиотекаКартинок.TapLinkBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		Возврат БиблиотекаКартинок.ЛоготипTelegram;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Tilda Тогда
		Возврат БиблиотекаКартинок.TildaBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Vkontakte Тогда
		Возврат БиблиотекаКартинок.VkontakteBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		Возврат БиблиотекаКартинок.VkontakteBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		Возврат БиблиотекаКартинок.ЛоготипViber;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда
		Возврат БиблиотекаКартинок.ЛоготипWallet;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Webhook Тогда
		Возврат БиблиотекаКартинок.WebhookFitnesBigIcon;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи Тогда
		Возврат БиблиотекаКартинок.ЛоготипОнлайнЗаписи;              
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ЯндексКарты Тогда
		Возврат БиблиотекаКартинок.ЛоготипЯндексКарты;                              
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ОценкиИОтзывы Тогда
		Возврат БиблиотекаКартинок.ЛоготипОценкиИОтзывы;                            
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ЯндексМетрика Тогда
		Возврат БиблиотекаКартинок.ФормаЭлементаЯндексМетрика;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ПроДокторов Тогда
		Возврат БиблиотекаКартинок.ЛоготипПроДокторов;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ИЭМК Тогда
		Возврат БиблиотекаКартинок.ЛоготипИЭМК;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.КонтурСтрахование Тогда
		Возврат БиблиотекаКартинок.ЛоготипКонтурСтрахование;
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей Тогда
		Возврат БиблиотекаКартинок.СсылкиНаОплату_СБП_256;
	КонецЕсли;                                                                          
	
	Возврат БиблиотекаКартинок.ДиалогВопрос;
	
КонецФункции

// Функция, возвращает имя раздела внешней системы.
//
Функция ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы) Экспорт
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Calltouch Тогда
		Возврат "СквознаяАналитика";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда
		Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.CoMagic Тогда
		Возврат "СквознаяАналитика";
	// ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Instagram Тогда
	//	Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.IPТелефония Тогда
		Возврат "Телефония";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.JivoSite Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Marquiz Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Roistat Тогда
		Возврат "СквознаяАналитика";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ЯндексМетрика Тогда
		Возврат "СквознаяАналитика";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.TapLink Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Tilda Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Vkontakte Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		Возврат "Мессенджеры";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда
		Возврат "ЭлектронныеКарты";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Webhook Тогда
		Возврат "ИсточникиЛидов";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи Тогда
		Возврат "ОнлайнЗапись";
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ПроДокторов Тогда
		Возврат "ОнлайнЗапись";
	Иначе
		Возврат "Прочее";
	КонецЕсли;
	
КонецФункции

// Функция, возвращает список данных внешних систем мессенджера.
//
Функция ПолучитьДоступныеВнешниеСистемыМессенджера(Получатель, СтруктурнаяЕдиница,ДляОтправкиПервым = Ложь, МассивТребуемыхТелефонов = Неопределено)	Экспорт	
	
	Если МассивТребуемыхТелефонов <> Неопределено И ТипЗнч(МассивТребуемыхТелефонов) = Тип("Строка") Тогда
		МассивНомеров = Новый Массив;
		МассивНомеров.Добавить(МассивТребуемыхТелефонов);
	Иначе
		МассивНомеров = МассивТребуемыхТелефонов;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВнешниеСистемыВсе
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистемВсе)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В (ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка), &СтруктурнаяЕдиница)
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВнешниеСистемыОтправитьПервым
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистемОтправитьПервым)
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В (ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка), &СтруктурнаяЕдиница)
	|	И ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактыМессенджеров.Идентификатор КАК Идентификатор,
	|	КонтактыМессенджеров.ВнешняяСистема КАК ВнешняяСистема,
	|	КонтактыМессенджеров.НомерМессенджера КАК НомерМессенджера,
	|	КонтактыМессенджеров.НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке,
	|	0 КАК ПорядокСортировки
	|ПОМЕСТИТЬ СуществующиеКонтакты
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешниеСистемыВсе КАК ВнешниеСистемыВсе
	|		ПО КонтактыМессенджеров.ВнешняяСистема = ВнешниеСистемыВсе.Ссылка
	|ГДЕ
	|	КонтактыМессенджеров.ОбъектИдентификации = &Получатель
	|	И НЕ КонтактыМессенджеров.ОбъектИдентификации В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Заявки.ПустаяСсылка))
	|   И &УсловиеОтбораПоНомерамСуществующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемыОтправитьПервым.Ссылка КАК ВнешняяСистема,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерМессенджера,
	|	ЗНАЧЕНИЕ(Перечисление.Мессенджеры.whatsapp) КАК Мессенджер,
	|	1 КАК ПорядокСортировки
	|ПОМЕСТИТЬ ДоступныеКонтакты
	|ИЗ
	|	ВнешниеСистемыОтправитьПервым КАК ВнешниеСистемыОтправитьПервым,
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Получатель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке
	|	И НЕ (ВнешниеСистемыОтправитьПервым.Ссылка, КонтактнаяИнформация.НомерТелефона) В
	|				(ВЫБРАТЬ
	|					СуществующиеКонтакты.ВнешняяСистема,
	|					СуществующиеКонтакты.НомерМессенджера
	|				ИЗ
	|					СуществующиеКонтакты КАК СуществующиеКонтакты)
	|  И &УсловиеОтбораПоНомерамДоступные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СуществующиеКонтакты.Идентификатор КАК Идентификатор,
	|	СуществующиеКонтакты.ВнешняяСистема КАК ВнешняяСистема,
	|	СуществующиеКонтакты.НомерМессенджера КАК НомерМессенджера,
	|	СуществующиеКонтакты.ПорядокСортировки КАК ПорядокСортировки
	|ИЗ
	|	СуществующиеКонтакты КАК СуществующиеКонтакты
	|ГДЕ
	|	СуществующиеКонтакты.НеУчаствоватьВРассылке = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ДоступныеКонтакты.ВнешняяСистема,
	|	ДоступныеКонтакты.НомерМессенджера,
	|	ДоступныеКонтакты.ПорядокСортировки
	|ИЗ
	|	ДоступныеКонтакты КАК ДоступныеКонтакты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСортировки");
	
	Если ДляОтправкиПервым Тогда
		ТипыВнешнихСистемВсе			 = Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым();
	Иначе
		ТипыВнешнихСистемВсе			 = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();	
	КонецЕсли;
	ТипыВнешнихСистемОтправитьПервым = Справочники.ВнешниеСистемы.ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым();

	Запрос.УстановитьПараметр("Получатель"						, Получатель);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"				, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТипыВнешнихСистемВсе"			, ТипыВнешнихСистемВсе);
	Запрос.УстановитьПараметр("ТипыВнешнихСистемОтправитьПервым", ТипыВнешнихСистемОтправитьПервым);
	
	Если МассивНомеров <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНомерамДоступные", "КонтактнаяИнформация.НомерТелефона В (&МассивТребуемыхНомеров)"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНомерамСуществующие", "КонтактыМессенджеров.НомерМессенджера В (&МассивТребуемыхНомеров)");
		Запрос.УстановитьПараметр("МассивТребуемыхНомеров",МассивНомеров);
	Иначе
		Запрос.УстановитьПараметр("УсловиеОтбораПоНомерамДоступные", Истина); 
		Запрос.УстановитьПараметр("УсловиеОтбораПоНомерамСуществующие", Истина);
	КонецЕсли;
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Заявки") Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация",
			"Справочник.Заявки.КонтактнаяИнформация КАК КонтактнаяИнформация"
		);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокЗначений = Новый СписокЗначений;
	
	Для Каждого ДанныеКонтакта Из РезультатЗапроса Цикл
		
		Значение		 = СтрокуТаблицыЗначенийВСтруктуру(ДанныеКонтакта, РезультатЗапроса);
		Представление	 = СформироватьПредставлениеКонтактаМессенджера(ДанныеКонтакта);
		Картинка		 = КартинкаТипаВнешнейСистемы(ДанныеКонтакта.ВнешняяСистема.ТипВнешнейСистемы);
		
		СписокЗначений.Добавить(Значение, Представление,, Картинка);
		
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

// Функция, возвращает представление контакта мессенджера.
//
Функция СформироватьПредставлениеКонтактаМессенджера(ДанныеКонтакта)
	
	Представление = ДанныеКонтакта.ВнешняяСистема.Наименование;
		
	Представление = ?(
		ДанныеКонтакта.ПорядокСортировки = 1,
		"Создать контакт (+" + ДанныеКонтакта.НомерМессенджера + ") - " + Представление,
		Представление + ?(ЗначениеЗаполнено(ДанныеКонтакта.НомерМессенджера), " (" + ДанныеКонтакта.НомерМессенджера + ")", "")
	);
	
	Возврат Представление;
	
КонецФункции

// Функция - Проверить существование доступных внешних систем для отправки первым
// 
// Возвращаемое значение:
//   - 
//
Функция СуществуютДоступныеВнешниеСистемыМессенджераДляОтправкиПервым(СтруктурнаяЕдиница) Экспорт
	
	 Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.СтруктурнаяЕдиница В (ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка), &СтруктурнаяЕдиница)
	|	И ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнейСистемы)");	
	
    Запрос.УстановитьПараметр("ТипыВнешнейСистемы", ПолучитьТипыВнешнихСистемМессенджераОтправитьПервым());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	Возврат НЕ Запрос.Выполнить().Пустой();

	
КонецФункции

#КонецОбласти
